In [3]:
def checkyear(year): #2000
    return ((( year % 4==0) and (year % 100 !=0)) or (year%400==0))
year=2004
if (checkyear(year)):
	print('leap year')
else:
	print("Not a leap year")

leap year

In [4]:
import pandas as pd

In [15]:
df=pd.read_excel(r"C:\Users\siriv\OneDrive\Desktop\Udemy\Example\Python_Sample.xlsx")

In [16]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.columns

Index(['School Name', 'Area Code', 'City Code', 'State', 'No.of students',
       'Presents', 'Absents', 'Section', 'Floor'],
      dtype='object')

In [27]:
df.head(2) #(First rows of table)

,School Name,Area Code,City Code,State,No.of students,Presents,Absents,Section,Floor
0,Chaitanya,VJA,1,AS,185,180,5,A,1
1,Srinivasa,HYD,8,TS,195,115,80,C,3

In [33]:
df.tail(2) #last two rows of table

,School Name,Area Code,City Code,State,No.of students,Presents,Absents,Section,Floor
28,Shree Swaminarayan Gurukul International School,TPR,8,AP,186,180,6,C,5
29,A.j.i. English School,MTM,1,AS,148,145,3,A,2

In [29]:
df.dtypes #to know about the data type

School Name       object
Area Code         object
City Code          int64
State             object
No.of students     int64
Presents           int64
Absents            int64
Section           object
Floor              int64
dtype: object

In [30]:
df.index

RangeIndex(start=0, stop=30, step=1)

In [31]:
df.shape

(30, 9)

In [37]:
df.Absents.unique() # for specific column or row

array([ 5, 80, 29, 23, 30, 18, 17,  2, 43, 22,  1,  0,  3, 10, 15,  7, 20,
        6], dtype=int64)

In [42]:
df[2:5]

,School Name,Area Code,City Code,State,No.of students,Presents,Absents,Section,Floor
2,St. Anns,MTM,2,AS,147,118,29,B,2
3,St. Maris,MTM,1,AS,128,105,23,A,3
4,Delhi Public School,HYD,8,TS,139,109,30,B,2